app/views/posts/index.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT 1  [["post_id", 25]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 25]]
---
<h3>Comments</h3>
<% if post.comments.any? %>