app/views/posts/show.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT 1  [["post_id", 77]]
---

<% if @post.comments.any? %>