app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Google"], ["url", "http://www.google.com"], ["created_at", "2015-01-15 20:14:26.137885"], ["updated_at", "2015-01-15 20:14:26.137885"]]
---
	def create
		@post = Post.create(post_params)